[
  {
    "id": 1,
    "title": "Controller / Director of Finance",
    "shortDescription": "Financial reporting activities, including payroll and accounts payable, budgeting, cost tracking, variance analysis, coordinating external audit and tax activities, and managing internal spend controls.",
    "aboutUs": "Longview Infrastructure is a new competitive transmission development company formed to bid, win, develop, construct, own and operate electric transmission infrastructure across North America.\n\nLongview’s team has held leadership roles at national transmission developers. It has been directly responsible for bidding, winning, developing, and delivering about a third of the competitive transmission in the country. Longview is backed by a large institutional infrastructure investor.\n\nThis position offers an unusual opportunity to apprentice in a rapidly growing and niche field. Longview is looking to identify talented, ambitious hires who are looking to take on a challenge and grow with the company.",

    "fullDescription": "Accounting and financial controls underpin Longview’s ability to develop transmission across North America. The <strong>Controller / Director of Finance</strong> will be responsible for Longview’s budgeting and financial reporting activities, including payroll and accounts payable, budgeting, cost tracking, variance analysis, coordinating external audit and tax activities, and managing internal spend controls. Further, the position will be responsible for regulatory reporting (e.g., formula rate filings) and interaction under Longview’s relationship with its infrastructure investor.",

    "roles": [
      "Oversee the company’s financial processes and technology, including payroll,budgets, controls, payments, and accounting",
      "Manage tax planning and compliance, including federal and state, property tax, and sales and use taxes",
      "Support cost forecasting and budgeting and analyze financial performance",
      "Manage the formation and interaction of subsidiaries",
      "Manage regulatory accounting processes including formula rate filings",
      "Innovate on financial structures for electric transmission"
    ],
    "aboutYou": [
      "10+ years’ professional finance, accounting, and controlling experience, including at least 5 in power and utilities",
      "Bachelor’s Degree in Finance, Accounting, or other quantitative discipline",
      "Experience in FERC regulatory accounting a plus",
      "Critical thinker – analytical and solution-focused",
      "Entrepreneurial – identify what’s needed and get it done",
      "Team player – helps the team and learns along the way"
    ],
    "whatWeOffer": [
      "Competitive salary and bonus, commensurate with experience",
      "Equity participation commensurate with experience",
      "Excellent health, dental, vision, insurance, 401(k) and generous Paid Time Off",
      "Work with a hard-working, high-quality, collaborative team"
    ],
    "link": "/jobs/project-manager.html",
    "type": "Full-Time",
    "location": "Chesterfield, Missouri / San Francisco, California",
    "locationDescription": "Longview has offices in <strong>Chesterfield, Missouri and San Francisco, California</strong>. This role is expected to be in the office when not traveling for work."
  },
  {
    "id": 2,
    "title": "Project Manager / Project Director",
    "shortDescription": "Design, estimate, and develop transmission facilities while maintaining Longview’s engineering standards.",
    "aboutUs": "Longview is a national developer of electric transmission. It has decades of experience and a commitment to building a safe, reliable, affordable grid.\n\nAt Longview Infrastructure, we bring unparalleled expertise to the transmission sector. Our team comprises seasoned leaders who have held pivotal roles at top national transmission developers. Together, we have successfully bid, won, developed, and delivered over $5 billion in transmission and 5GW of generation.\n\nLongview is seeking driven and ambitious professionals ready to embrace new challenges and grow alongside our dynamic team.",

    "fullDescription": "At Longview Infrastructure, efficient design is the foundation of our success in bidding, winning, developing, constructing, and owning electric transmission projects across North America. We are seeking a <strong>Project Manager / Project Director</strong> to play a critical role in the preparation of bids and early-stage development of transmission facilities.\n\nIn this role, you will collaborate with our Development team to design, estimate, and develop transmission facilities while maintaining Longview’s engineering standards.\n\nAs part of a rapidly growing organization in a market that has expanded exponentially in the past five years, this role offers a unique opportunity to take on meaningful challenges and drive innovation. Longview is committed to identifying ambitious, talented individuals who are eager to grow into senior leadership roles as it continues to scale.",

    "roles": [
      "Design transmission and substation projects for bids and early-stage development including selecting and optimizing structures, conductors, pole spotting, and foundation designs",
      "Review consultant and contractor design packages, including structure families, design criteria, substation general arrangements, equipment selection, and material/construction specifications",
      "Collaborate with internal teams (construction, environmental, land use, etc.) as well as external consultants/contractors to identify the most effective solutions",
      "Develop and lead project engineering teams by engaging with and selecting engineering consultants, equipment vendors, and construction contractors"
    ],
    "aboutYou": [
      "5+ plus years of experience in design and engineering of high voltage transmission",
      "Strong understanding of transmission structure design (loading trees, manufacturing and construction methods, cost optimization, and industry standard software platforms)",
      "Bachelor’s Degree in Civil, Mechanical, or Electrical Engineering",
      "Critical thinker – analytical and solution-focused",
      "Independent – organizes own workstream based on broad objectives",
      "Team player – looking to help the team and learn along the way"
    ],
    "whatWeOffer": [
      "Competitive salary, bonus, and equity participation commensurate with experience",
      "Excellent health, dental, vision, insurance, 401(k) and generous Paid Time Off",
      "Opportunity to grow with a company of experienced and dedicated professionals"
    ],
    "link": "/jobs/project-manager.html",
    "type": "Full-Time",
    "location": "Chesterfield, MO",
    "locationDescription": "Chesterfield, MO"
  }
]
